Repository: RuCoder-sudo/woo-moysklad-integration
Catalog: languages/woo-moysklad-integration-*.po
Languages: ru_ru

source: WooCommerce MoySklad Integration
ru_ru: Интеграция WooCommerce с МойСклад

source: Comprehensive integration between WooCommerce and MoySklad.ru (МойСклад) for product, inventory, and order synchronization.
ru_ru: Полная интеграция между WooCommerce и МойСклад для синхронизации товаров, запасов и заказов.

source: Your Name
ru_ru: Ваше Имя

source: Please install and activate WooCommerce before activating WooCommerce MoySklad Integration.
ru_ru: Пожалуйста, установите и активируйте WooCommerce перед активацией интеграции WooCommerce с МойСклад.

source: MoySklad API credentials are not configured
ru_ru: Учетные данные API МойСклад не настроены

source: Unknown API error
ru_ru: Неизвестная ошибка API

source: API not configured
ru_ru: API не настроен

source: Product synchronization is disabled
ru_ru: Синхронизация товаров отключена

source: Synchronization completed: %d created, %d updated, %d failed, %d skipped
ru_ru: Синхронизация завершена: %d создано, %d обновлено, %d не удалось, %d пропущено

source: No products to sync inventory for
ru_ru: Нет товаров для синхронизации запасов

source: Inventory synchronization completed: %d updated, %d failed
ru_ru: Синхронизация запасов завершена: %d обновлено, %d не удалось

source: Category synchronization is disabled
ru_ru: Синхронизация категорий отключена

source: No categories found in MoySklad
ru_ru: Категории в МойСклад не найдены

source: Categories synchronized: %d created, %d updated, %d skipped
ru_ru: Категории синхронизированы: %d создано, %d обновлено, %d пропущено

source: Customer price type synchronization is disabled
ru_ru: Синхронизация типов цен для клиентов отключена

source: No price types found in MoySklad
ru_ru: Типы цен в МойСклад не найдены

source: No customer groups found in MoySklad
ru_ru: Группы клиентов в МойСклад не найдены

source: Synchronized %d price types and %d customer groups
ru_ru: Синхронизировано %d типов цен и %d групп клиентов

source: Empty payload
ru_ru: Пустая полезная нагрузка

source: Unhandled webhook type
ru_ru: Необработанный тип вебхука

source: Updated %d products, %d variants, %d failed
ru_ru: Обновлено %d товаров, %d вариантов, %d не удалось

source: Permission denied
ru_ru: Доступ запрещен

source: Webhooks are disabled in settings
ru_ru: Вебхуки отключены в настройках

source: Webhooks registered
ru_ru: Вебхуки зарегистрированы

source: Are you sure you want to clear all logs?
ru_ru: Вы уверены, что хотите очистить все логи?

source: This will start the synchronization process. Continue?
ru_ru: Это запустит процесс синхронизации. Продолжить?

source: Synchronization is in progress...
ru_ru: Синхронизация выполняется...

source: Synchronization completed successfully!
ru_ru: Синхронизация успешно завершена!

source: Synchronization failed. Check logs for details.
ru_ru: Синхронизация не удалась. Проверьте логи для подробностей.

source: Connection successful!
ru_ru: Соединение успешно!

source: Connection failed. Check your credentials.
ru_ru: Соединение не удалось. Проверьте ваши учетные данные.

source: Webhooks registered successfully!
ru_ru: Вебхуки успешно зарегистрированы!

source: Failed to register webhooks. Check logs for details.
ru_ru: Не удалось зарегистрировать вебхуки. Проверьте логи для подробностей.

source: Enabled
ru_ru: Включено

source: Disabled
ru_ru: Отключено

source: Synchronization in progress
ru_ru: Выполняется синхронизация

source: Synchronization is not running
ru_ru: Синхронизация не выполняется

source: Product Synchronization
ru_ru: Синхронизация товаров

source: Sync Status
ru_ru: Статус синхронизации

source: Last Product Sync
ru_ru: Последняя синхронизация товаров

source: Never
ru_ru: Никогда

source: Last Inventory Sync
ru_ru: Последняя синхронизация запасов

source: Sync Products Now
ru_ru: Синхронизировать товары сейчас

source: Sync Categories Only
ru_ru: Синхронизировать только категории

source: Sync Inventory Only
ru_ru: Синхронизировать только запасы

source: Settings
ru_ru: Настройки

source: Sync Statistics
ru_ru: Статистика синхронизации

source: Total Products Synced
ru_ru: Всего синхронизировано товаров

source: Simple Products
ru_ru: Простые товары

source: Variable Products
ru_ru: Вариативные товары

source: Product Variations
ru_ru: Вариации товаров

source: Categories Synced
ru_ru: Синхронизировано категорий

source: Synchronization Guide
ru_ru: Руководство по синхронизации

source: This plugin synchronizes products, inventory, and orders between WooCommerce and MoySklad. Here's how to use it:
ru_ru: Этот плагин синхронизирует товары, запасы и заказы между WooCommerce и МойСклад. Вот как его использовать:

source: Configure your MoySklad API credentials in the Settings tab.
ru_ru: Настройте учетные данные API МойСклад во вкладке Настройки.

source: Enable synchronization and configure sync options in the Settings tab.
ru_ru: Включите синхронизацию и настройте параметры синхронизации во вкладке Настройки.

source: Click "Sync Products Now" to manually start product synchronization.
ru_ru: Нажмите "Синхронизировать товары сейчас", чтобы вручную запустить синхронизацию товаров.

source: Click "Sync Inventory Only" to update only product stock levels.
ru_ru: Нажмите "Синхронизировать только запасы", чтобы обновить только уровни запасов товаров.

source: Orders are automatically synchronized when created in WooCommerce.
ru_ru: Заказы автоматически синхронизируются при создании в WooCommerce.

source: For real-time updates, enable and configure webhooks in the Settings tab.
ru_ru: Для обновлений в реальном времени включите и настройте вебхуки во вкладке Настройки.

source: The plugin also supports scheduled synchronization through WordPress cron jobs based on your settings.
ru_ru: Плагин также поддерживает запланированную синхронизацию через задания cron WordPress на основе ваших настроек.

source: Manage order synchronization between WooCommerce and MoySklad.
ru_ru: Управление синхронизацией заказов между WooCommerce и МойСклад.

source: Order Synchronization Status
ru_ru: Статус синхронизации заказов

source: Order Sync
ru_ru: Синхронизация заказов

source: Order Status Sync
ru_ru: Синхронизация статусов заказов

source: Status Sync from MoySklad
ru_ru: Синхронизация статусов из МойСклад

source: Order Prefix
ru_ru: Префикс заказа

source: Orders Synced
ru_ru: Синхронизировано заказов

source: Sync Delay
ru_ru: Задержка синхронизации

source: Orders are synced after %d minutes
ru_ru: Заказы синхронизируются после %d минут

source: Orders are synced immediately
ru_ru: Заказы синхронизируются немедленно

source: Order Settings
ru_ru: Настройки заказов

source: Order Status Mapping
ru_ru: Сопоставление статусов заказов

source: No order status mapping configured. Please configure the status mapping in the settings.
ru_ru: Сопоставление статусов заказов не настроено. Пожалуйста, настройте сопоставление статусов в настройках.

source: WooCommerce Status
ru_ru: Статус WooCommerce

source: MoySklad Status ID
ru_ru: ID статуса МойСклад

source: This table shows how WooCommerce order statuses are mapped to MoySklad order statuses.
ru_ru: Эта таблица показывает, как статусы заказов WooCommerce сопоставляются со статусами заказов МойСклад.

source: You can configure this mapping in the Order Settings tab.
ru_ru: Вы можете настроить это сопоставление во вкладке Настройки заказов.

source: Recently Synced Orders
ru_ru: Недавно синхронизированные заказы

source: No orders have been synced yet.
ru_ru: Еще не синхронизировано ни одного заказа.

source: Order ID
ru_ru: ID заказа

source: Date
ru_ru: Дата

source: MoySklad ID
ru_ru: ID в МойСклад

source: Actions
ru_ru: Действия

source: View
ru_ru: Просмотр

source: Order Synchronization Guide
ru_ru: Руководство по синхронизации заказов

source: This plugin synchronizes orders from WooCommerce to MoySklad. Here's how it works:
ru_ru: Этот плагин синхронизирует заказы из WooCommerce в МойСклад. Вот как это работает:

source: When a new order is created in WooCommerce, it is automatically sent to MoySklad.
ru_ru: Когда в WooCommerce создается новый заказ, он автоматически отправляется в МойСклад.

source: Order items are mapped to products in MoySklad using the product mapping created during product synchronization.
ru_ru: Позиции заказа сопоставляются с товарами в МойСклад с использованием сопоставления товаров, созданного во время синхронизации товаров.

source: Customer information is sent to MoySklad and linked to the order.
ru_ru: Информация о клиенте отправляется в МойСклад и связывается с заказом.

source: When order statuses change in WooCommerce, they can be automatically updated in MoySklad based on your status mapping.
ru_ru: Когда статусы заказов изменяются в WooCommerce, они могут автоматически обновляться в МойСклад на основе вашего сопоставления статусов.

source: Optionally, status changes in MoySklad can be synced back to WooCommerce if webhooks are properly configured.
ru_ru: При желании, изменения статусов в МойСклад могут синхронизироваться обратно в WooCommerce, если вебхуки настроены правильно.

source: To configure order synchronization settings, go to the Order Settings tab.
ru_ru: Для настройки параметров синхронизации заказов перейдите на вкладку Настройки заказов.

source: View logs of plugin activity and synchronization operations.
ru_ru: Просмотр логов активности плагина и операций синхронизации.

source: Plugin Logs
ru_ru: Логи плагина

source: Filter by level:
ru_ru: Фильтр по уровню:

source: All Levels
ru_ru: Все уровни

source: Clear Logs
ru_ru: Очистить логи

source: Logging to database is currently disabled. No logs will be shown here.
ru_ru: Логирование в базу данных в настоящее время отключено. Здесь не будут показаны логи.

source: Enable in settings
ru_ru: Включить в настройках

source: Time
ru_ru: Время

source: Level
ru_ru: Уровень

source: Message
ru_ru: Сообщение

source: Context
ru_ru: Контекст

source: Loading logs...
ru_ru: Загрузка логов...

source: Configure Log Settings
ru_ru: Настроить параметры логирования

source: Configure WooCommerce MoySklad Integration settings.
ru_ru: Настройте параметры интеграции WooCommerce с МойСклад.

source: API Settings
ru_ru: Настройки API

source: Products
ru_ru: Товары

source: Inventory
ru_ru: Запасы

source: Orders
ru_ru: Заказы

source: Customers
ru_ru: Клиенты

source: Webhooks
ru_ru: Вебхуки

source: Logs
ru_ru: Логи
